Repository: BozoDel/LoveKnowsNoBorders-PT
Catalog: lovePT-level2.tmx
Source language: en_us
Languages: pt_br

source: Calling reset makes the current drawing color white, the current background color black, disables any active [[Canvas]] or [[Shader]], and removes any scissor settings.
pt_br: Chamar o reset torna branca a cor de desenho atual, preta a cor de fundo atual, desativa todas [[Canvas (Português)|Pinturas]] ou [[Shader (Português)|Shaders]], e remove todas configurações de recorte.

source: It has been renamed to [[love.graphics.newShader]]
pt_br: Foi renomeado para [[love.graphics.newShader]]

source: FontData
pt_br: DadoDeFonte

source: * [[ FontData]]
pt_br: * [[ FontData (Português)|DadoDeFonte]]

source: Drawing a rectangle using a pixel effect
pt_br: Desenhar um retângulo usado um efeito de pixel

source: A [[Mesh]] might have many more.) Pixel shaders are run once for each pixel on the screen which the drawn object touches.
pt_br: Uma [[Mesh (Português)|Malha]] pode ter muito mais.) Shaders de pixel rodam uma vez para cada pixel na tela que o objeto desenhado toca.

source: The scaling in the direction of the x-axis.
pt_br: O redimensionamento na direção do eixo x.

source: success
pt_br: sucesso

source: The name of the renderer, e.g. "OpenGL".
pt_br: O nome do renderizador, por exemplo, "OpenGL".

source: mode = love.graphics.getColorMode( )
pt_br: modo = love.graphics.getColorMode( )

source: Shaders are small programs which are run on the video card when drawing.
pt_br: Shaders são pequenos programas que rodam na placa de vídeo ao desenhar.

source: GlyphData
pt_br: DadoDeGlifo

source: Releases the active stencil.
pt_br: Libera o estêncil ativo.

source: model = love.audio.getDistanceModel( )
pt_br: modelo = love.audio.getDistanceModel( )

source: Absolute path to the game's source folder.
pt_br: Caminho absoluto da pasta fonte do jogo.

source: canvas = love.graphics.newCanvas( )
pt_br: pintura = love.graphics.newCanvas( )

source: alpha (255)
pt_br: alfa (255)

source: * [[ Source]]
pt_br: * [[ Source (Português)|Fonte]]

source: How to draw the rectangle.
pt_br: Como desenhar o retângulo.

source: Sets the line style.
pt_br: Configura o estilo de linha.

source: The more segments, the smoother the edge.
pt_br: Quanto mais segmentos, mais suave a borda.

source: The [[Image]] or [[Canvas]] to use when drawing the Mesh. May be nil to use no texture.
pt_br: A [[Image (Português)|Imagem]] ou [[Canvas (Português)|Pintura]] a ser usada ao desenhar a Malha. Pode ser nil para não usar textura nenhuma.

source: Sets the color mask. Enables or disables specific color components when rendering.
pt_br: Configura a máscara de cor. Ativa ou desativa componentes de cor específicos ao renderizar.

source: image = love.graphics.newImage( imageData )
pt_br: imagem = love.graphics.newImage( dadoDeImagem )

source: * [[ Rasterizer]]
pt_br: * [[ Rasterizer (Português)|Rasterizador]]

source: The text to draw.
pt_br: O texto a ser desenhado.

source: The Z position of the listener.
pt_br: A posição em Z do ouvinte.

source: Scales the coordinate system in two dimensions.
pt_br: Redimensiona o sistema de coordenadas em duas dimensões.

source: love.graphics.arc( mode, x, y, radius, angle1, angle2, segments )
pt_br: love.graphics.arc( modo, x, y, raio, angulo1, angulo2, segmentos )

source: FilterMode
pt_br: ModoDeFiltragem

source: Uses [[love.graphics.push]] and [[love.graphics.pop]] to return to normal render scale.
pt_br: Usa [[love.graphics.push (Português)|love.graphics.push]] e [[love.graphics.pop (Português)|love.graphics.pop]] para retornar à escala de renderização normal.

source: limittype
pt_br: tipodelimite

source: The position of the top right corner along y-axis.
pt_br: A posição do canto superior direito no eixo y.

source: The purpose of a Quad is to describe the result of the following transformation on any drawable object.
pt_br: O propósito do Quad é descrever o resultado da seguinte transformação em qualquer objeto desenhável.

source: Manages events, like keypresses.
pt_br: Gerencia eventos, como por exemplo teclas pressionadas.

source: love.graphics.line( points )
pt_br: love.graphics.line( pontos )

source: The root folder of the .love archive (or source directory)
pt_br: A pasta raiz do arquivo .love (ou diretório fonte)

source: Gets the point size.
pt_br: Obtém o tamanho de ponto.

source: love.graphics.setBackgroundColor( red, green, blue )
pt_br: love.graphics.setBackgroundColor( vermelho, verde, azul )

source: rasterizer = love.font.newRasterizer( imageData, glyphs )
pt_br: rasterizador = love.font.newRasterizer( dadoDeImagem, glifos )

source: Draws a rectangle at 20,50 with a width of 60 and a height of 120
pt_br: Desenhar um retângulo em 20,50, com 60 de largura e 120 de altura

source: compressedData
pt_br: dadoComprimido

source: love.audio.rewind( source )
pt_br: love.audio.rewind( fonte )

source: style = love.graphics.getLineStyle( )
pt_br: estilo = love.graphics.getLineStyle( )

source: Iterate over the lines in a file.
pt_br: Itera pelas linhas de um arquivo.

source: The source to rewind.
pt_br: A fonte a ser rebobinada.

source: Read the contents of a file
pt_br: Ler o conteúdo de um arquivo

source: It has been renamed from [[love.graphics.setRenderTarget]]
pt_br: Foi renomeado, antes era [[love.graphics.setRenderTarget (Português)|love.graphics.setRenderTarget]]

source: The pattern is repeated to complete the line.
pt_br: O padrão é repetido para completar a linha.

source: Drawing
pt_br: Desenho

source: Nothing.
pt_br: Nada.

source: While active, it is used to test where pixels will be drawn or discarded.
pt_br: Enquando ativo, é usado para testar onde os pixels serão desenhados ou descartados.

source: Gets the current number of simultaneously playing sources.
pt_br: Obtém o número de fontes tocando atualmente.

source: SourceType
pt_br: TipoDeFonte

source: 1.0f is max and 0.0f is off.
pt_br: 1.0f é o máximo e 0.0f é o desligado.

source: The angle at which the arc begins.
pt_br: O ângulo no qual o arco começa.

source: * [[ PixelEffect]]
pt_br: * [[ PixelEffect (Português)|EfeitoDePixel]]

source: The second render target.
pt_br: O segundo alvo de renderização.

source: * [[BlendMode]]
pt_br: * [[BlendMode (Português)|ModoDeMistura]]

source: This module is not supported in earlier versions
pt_br: Este módulo não é suportado em versões anteriores

source: love.graphics.setLine( width, style )
pt_br: love.graphics.setLine( espessura, estilo )

source: The shader language is basically [http://www.opengl.org/sdk/docs/manglsl/ GLSL 1.20] ([http://www.opengl.org/registry/doc/GLSLangSpec.Full.1.20.8.pdf specs]) with a few aliases added for existing types:
pt_br: A linguagem de shader é basicamente [http://www.opengl.org/sdk/docs/manglsl/ GLSL 1.20] ([http://www.opengl.org/registry/doc/GLSLangSpec.Full.1.20.8.pdf especificações]) com alguns nomes alternativos adicionados para os tipos existentes:

source: Draw the top half of an image (the [https://love2d.org/w/images/c/c3/Resource-HamsterBall.png Hamster Ball]) at 100 by 100 pixels.
pt_br: Desenha a metade de cima de uma imagem (a [https://love2d.org/w/images/c/c3/Resource-HamsterBall.png Bola de Hamster]) na posição 100 por 100 pixels.

source: The graphics feature to check for.
pt_br: O recurso gráfico a ser checado.

source: A 16-bit pattern.
pt_br: Um padrão de 16-bit.

source: The blue component (0-255).
pt_br: A componente azul (0-255).

source: Drawable
pt_br: Desenhável

source: decoder ("file")
pt_br: decodificador ("file")

source: It sets the [[BlendMode]] to alpha , enables all [[love.graphics.setColorMask|color component masks]], disables [[love.graphics.setWireframe|wireframe mode]] and resets the current graphics transformation to the [[love.graphics.origin|origin]].
pt_br: Configura o [[BlendMode (Português)|ModoDeMistura]] como alfa , ativa todas [[love.graphics.setColorMask (Português)|máscaras de componente de cor]], desativa o [[love.graphics.setWireframe (Português)|modo de estrutura de arame]] e reconfigura o modo de transformação gráfica atual de volta à [[love.graphics.origin (Português)|origem]].

source: sh
pt_br: as

source: Up vector of the listener orientation.
pt_br: Vetor superior da orientação do ouvinte.

source: Scaling the coordinate system changes this relation.
pt_br: Redimensionar o sistema de coordenadas muda essa relação.

source: The path and name to a file.
pt_br: O caminho e nome de um arquivo.

source: Recursively creates a directory.
pt_br: Cria um diretório recursivamente.

source: Source
pt_br: Fonte

source: Creates a new [[Font]].
pt_br: Cria uma nova [[Font (Português)|Fonte]].

source: love.graphics.setScissor( x, y, width, height )
pt_br: love.graphics.setScissor( x, y, largura, altura )

source: love.audio.setDistanceModel( model )
pt_br: love.audio.setDistanceModel( modelo )

source: Creates and sets a new [[Font]].
pt_br: Cria e configura uma nova [[Font (Português)|Fonte]].

source: Note that the offsets are applied before rotation, scaling, or shearing; scaling and shearing are applied before rotation.
pt_br: Repare que os deslocamentos são aplicados antes de rotação, redimensionamento ou inclinação; redimensionamento e inclinação são aplicados antes da rotação.

source: Note that the limit argument affects the position of your text for 'center' and 'right' alignment.
pt_br: Repare que o argumento limite afeta a posição do seu texto, com alinhamentos centralizados ("center") e à direita ("right").

source: The reference height, the height of the [[Image]]. (Must be greater than 0.)
pt_br: A altura de referência, a altura da [[Image (Português)|Imagem]]. (Tem que ser maior que 0.)

source: Scale and translate are not commutative operations, therefore, calling them in different orders will change the outcome.
pt_br: Redimensionamento e translação não são operações comutativas, portanto chamá-las em ordens diferentes afetará o resultado.

source: The filepath to the audio file.
pt_br: O caminho do arquivo de áudio.

source: version
pt_br: versao

source: Every result of a drawing operation is also correspondingly scaled, so scaling by (2, 2) for example would mean making everything twice as large in both x- and y-directions.
pt_br: Todos os resultados de operações de desenho também são redimensionados proporcionalmente, então uma escala de (2, 2) por exemplo significaria desenhar tudo com o dobro do tamanho tanto na direção x quanto na y.

source: Checking for events in 0.8.0
pt_br: Procurando eventos no 0.8.0

source: There can be up to 256 glyphs.
pt_br: Pode ter até 256 glifos.

source: The system-dependent max value for the feature.
pt_br: O valor máximo do recurso, dependendo do sistema.

source: Sets the point style.
pt_br: Configura o estilo de ponto.

source: The translation relative to the y-axis.
pt_br: A translação em relação ao eixo y.

source: The sequence of glyphs in the ImageData.
pt_br: A sequência de glifos do DadoDeImagem.

source: The position of second point on the x-axis.
pt_br: A posição do segundo ponto no eixo x.

source: The width of the Quad. (Must be greater than 0.)
pt_br: A largura do Quad. (Tem que ser maior que 0.)

source: Draws an arc.
pt_br: Desenha um arco.

source: size, errormsg = love.filesystem.getSize( filename )
pt_br: tamanho, msgerro = love.filesystem.getSize( nomeDoArquivo )

source: Width of the rectangle.
pt_br: A largura do retângulo.

source: This bluescreens if there is a syntax error in the loaded file.
pt_br: Se houver um erro de sintaxe no arquivo carregado, haverá uma tela azul.

source: Orientation (radians).
pt_br: Orientação (radianos).

source: The current working directory.
pt_br: O diretório de trabalho atual.

source: It returns the current transformation state to its defaults.
pt_br: Retorna o estado de transformação atual ao estado padrão.

source: glyphData = love.font.newGlyphData( rasterizer, glyph )
pt_br: dadoDeGlifo = love.font.newGlyphData( rasterizador, glifo )

source: Clears the screen to the [[love.graphics.setBackgroundColor|background color]] and restores the default coordinate system.
pt_br: Limpa a tela, pinta com a [[love.graphics.setBackgroundColor (Português)|cor de fundo]] e restaura o sistema de coordenadas padrão.

source: It has the following prototype:
pt_br: Ela tem o seguinte protótipo:

source: Note that the drawing commands have coordinates that depend solely on the screen size.
pt_br: Note que os comandos de desenho possuem coordenadas que dependem apenas do tamanho da tela.

source: size = love.graphics.getMaxImageSize( )
pt_br: tamanho = love.graphics.getMaxImageSize( )

source: Allows you to work with fonts.
pt_br: Permite trabalhar com fontes.

source: The scaling in the direction of the y-axis. If omitted, it defaults to same as parameter sx.
pt_br: O redimensionamento na direção do eixo y. Se omitido, por padrão, será igual ao parâmetro ex.

source: * [[love.event.wait]]
pt_br: * [[love.event.wait (Português)|love.event.wait]]

source: source = love.audio.newSource( file, type )
pt_br: fonte = love.audio.newSource( arquivo, tipo )

source: Origin offset (y-axis).
pt_br: Deslocamento da origem (eixo y).

source: GraphicsFeature
pt_br: RecursoGráfico

source: fx, fy, fz
pt_br: dx, dy, dz

source: Graphics State
pt_br: Estado dos Gráficos

source: Render red component.
pt_br: Renderizar componente vermelho.

source: style ("smooth")
pt_br: estilo ("smooth")

source: The path to a potential file.
pt_br: O caminho de um possível arquivo.

source: function CreateTexturedCircle(image, segments) segments = segments or 40 local vertices = {} -- The first vertex is at the center, and has a red tint. We're centering the circle around the origin (0, 0). table.insert(vertices, {0, 0, 0.5, 0.5, 255, 0, 0}) -- Create the vertices at the edge of the circle. for i=0, segments do local angle = (i / segments) * math.pi * 2 -- Unit-circle. local x = math.cos(angle) local y = math.sin(angle) -- Our position is in the range of [-1, 1] but we want the texture coordinate to be in the range of [0, 1]. local u = (x + 1) * 0.5 local v = (y + 1) * 0.5 -- The per-vertex color defaults to white. table.insert(vertices, {x, y, u, v}) end -- The "fan" draw mode is perfect for our circle. return love.graphics.newMesh(vertices, image, "fan") end function love.load() image = love.graphics.newImage("pig.png") mesh = CreateTexturedCircle(image) end function love.draw() local radius = 100 local mx, my = love.mouse.getPosition() -- We created a unit-circle, so we can use the scale parameter for the radius directly. love.graphics.draw(mesh, mx, my, 0, radius, radius) end
pt_br: function CriarCirculoTexturizado(imagem, segmentos) segmentos = segmentos or 40 local vertices = {} -- O primeiro vértice fica no centro, e tem um tom avermelhado. Vamos centralizar o círculo ao redor da origem (0, 0). table.insert(vertices, {0, 0, 0.5, 0.5, 255, 0, 0}) -- Criar os vértices na borda do círculo. for i=0, segmentos do local angulo = (i / segmentos) * math.pi * 2 -- Círculo unitário. local x = math.cos(angulo) local y = math.sin(angulo) -- Nossa posição está na faixa de [-1, 1], mas queremos que a coordenada de textura fique na faixa de [0, 1]. local u = (x + 1) * 0.5 local v = (y + 1) * 0.5 -- A cor padrão para cada vértice é branca. table.insert(vertices, {x, y, u, v}) end -- O modo de desenho "fan" (leque) é perfeito para o nosso círculo. return love.graphics.newMesh(vertices, imagem, "fan") end function love.load() imagem = love.graphics.newImage("pig.png") malha = CriarCirculoTexturizado(imagem) end function love.draw() local raio = 100 local mx, my = love.mouse.getPosition() -- Criamos um círculo unitário, então podemos usar o parâmetro de escala diretamente como raio. love.graphics.draw(malha, mx, my, 0, raio, raio) end

source: Shearing factor (x-axis).
pt_br: Fator de inclinação (eixo x).

source: chunk = love.filesystem.load( name )
pt_br: bloco = love.filesystem.load( nome )

source: sx
pt_br: ex

source: decoder = love.sound.newDecoder("bgm.ogg") bgm = love.audio.newSource(decoder)
pt_br: decodificador = love.sound.newDecoder("mdf.ogg") mdf = love.audio.newSource(decodificador)

source: love.audio.pause( source )
pt_br: love.audio.pause( fonte )

source: Draws a [[Drawable]] object (an [[Image]], [[Canvas]], [[SpriteBatch]], [[ParticleSystem]], or [[Mesh]]) on the screen with optional rotation, scaling and shearing.
pt_br: Desenha um objeto [[Drawable (Português)|Desenhável]] (uma [[Image (Português)|Imagem]], uma [[Canvas (Português)|Pintura]], um [[SpriteBatch (Português)|LoteDeSprites]], um [[ParticleSystem (Português)|SistemaDePartículas]], ou uma [[Mesh (Português)|Malha]]) na tela, com rotação, redimensionamento e inclinação opcionais.

source: Creates a new [[Font]] by loading a [[ImageFontFormat|specifically formatted]] image.
pt_br: Cria uma nova [[Font (Português)|Fonte]] carregando uma imagem [[ImageFontFormat (Português)|no formato apropriado]].

source: The name of the event.
pt_br: O nome do evento.

source: It needs to be opened before it can be accessed.
pt_br: É necessário que seja aberto antes que possa ser acessado.

source: Getting the time of a file and printing it as a date.
pt_br: Obtendo a hora de um arquivo e imprimindo-a como data.

source: font = love.graphics.newFont( data, size )
pt_br: fonte = love.graphics.newFont( dado, tamanho )

source: Unmounts a zip file or folder previously mounted for reading with [[love.filesystem.mount]].
pt_br: Desmonta um arquivo zip ou pasta anteriormente montados para leitura com [[love.filesystem.mount (Português)|love.filesystem.mount]].

source: A quadrilateral that has its top left corner located at 0,0 and whose width and height are 100 pixels.
pt_br: Um quadrilátero com seu canto superior esquerdo situado em 0,0 e cuja largura e altura são de 100 pixels.

source: Vertex shaders are run once for each vertex (for example, an image has 4 vertices - one at each corner.
pt_br: Shaders de vértice são rodados uma vez para cada vértice (por exemplo, uma imagem tem 4 vértices - um em cada canto.

source: The name of the graphics card, e.g. "Intel HD Graphics 3000 OpenGL Engine".
pt_br: O nome da placa de vídeo, por exemplo "Intel HD Graphics 3000 OpenGL Engine".

source: True if there is a file with the specified name. False otherwise.
pt_br: Verdadeiro se houver um arquivo com o nome especificado. Senão, falso.

source: screenshot = love.graphics.newScreenshot( copyAlpha )
pt_br: captura = love.graphics.newScreenshot( copiarAlfa )

source: Increase the point size by 1 by using [[love.graphics.setPointSize]].
pt_br: Aumentar em 1 o tamanho de ponto usando [[love.graphics.setPointSize (Português)|love.graphics.setPointSize]].

source: love.graphics.setColorMask( red, green, blue, alpha )
pt_br: love.graphics.setColorMask( vermelho, verde, azul, alfa )

source: The x axis is horizontal: larger values are further to the right.
pt_br: O eixo x é horizontal: valores maiores são mais para a direita.

source: size (12)
pt_br: tamanho (12)

source: * [[ImageFontFormat | Image Font Format]]
pt_br: * [[ImageFontFormat (Português)| Formato Imagem de Fonte]]

source: Repeat factor.
pt_br: Fator de repetição.

source: * [[ love.event]]
pt_br: * [[ love.event (Português)|love.event]]

source: Returns the default scaling filters.
pt_br: Retorna os filtros de redimensionamento padrão.

source: love.graphics.polygon( mode, ... )
pt_br: love.graphics.polygon( modo, ... )

source: Image or Canvas
pt_br: Imagem ou Pintura

source: Removes a file (or directory).
pt_br: Remove um arquivo (ou diretório).

source: shader = love.graphics.newShader( pixelcode, vertexcode )
pt_br: shader = love.graphics.newShader( codigodepixel, codigodevertice )

source: Gets the max supported width or height of Images and Canvases.
pt_br: Obtém a largura ou altura máxima suportada de Imagens e Pinturas.

source: Use a Quad to display part of an Image:
pt_br: Usando um Quad para mostrar parte de uma Imagem:

source: iterator = love.filesystem.lines( name )
pt_br: iterador = love.filesystem.lines( nome )

source: angle
pt_br: angulo

source: function love.load() filesString = recursiveEnumerate("", "") end -- This function will return a string filetree of all files -- in the folder and files in all subfolders function recursiveEnumerate(folder, fileTree) local lfs = love.filesystem local filesTable = lfs.getDirectoryItems(folder) for i,v in ipairs(filesTable) do local file = folder.."/"..v if lfs.isFile(file) then fileTree = fileTree.."\n"..file elseif lfs.isDirectory(file) then fileTree = fileTree.."\n"..file.." (DIR)" fileTree = recursiveEnumerate(file, fileTree) end end return fileTree end function love.draw() love.graphics.print(filesString, 0, 0) end
pt_br: function love.load() stringDeArquivos = enumerarRecursivamente("", "") end -- Esta função irá retornar um string contendo uma -- árvore de arquivos com todos arquivos na pasta e -- arquivos em todas subpastas function enumerarRecursivamente(pasta, arvoreDeArquivos) local lfs = love.filesystem local tabelaDeArquivos = lfs.getDirectoryItems(pasta) for i,v in ipairs(tabelaDeArquivos) do local arquivo = pasta.."/"..v if lfs.isFile(arquivo) then arvoreDeArquivos = arvoreDeArquivos.."\n"..arquivo elseif lfs.isDirectory(arquivo) then arvoreDeArquivos = arvoreDeArquivos.."\n"..arquivo.." (DIR)" arvoreDeArquivos = enumerarRecursivamente(arquivo, arvoreDeArquivos) end end return arvoreDeArquivos end function love.draw() love.graphics.print(stringDeArquivos, 0, 0) end

source: A numerical indexed table with the red, green, blue and alpha values as [[number]]s.
pt_br: Uma tabela com índice numérico com os valores de vermelho, verde, azul e alfa como [[number (Português)|números]].

source: It has been renamed to [[love.audio.getSourceCount]]
pt_br: Foi renomeado para [[love.audio.getSourceCount (Português)|love.audio.getSourceCount]]

source: * [[love.graphics.getDefaultFilter]]
pt_br: * [[love.graphics.getDefaultFilter (Português)|love.graphics.getDefaultFilter]]

source: file = love.filesystem.newFile( filename )
pt_br: arquivo = love.filesystem.newFile( nomeDoArquivo )

source: Its secondary responsibilities include loading external files (including [[Image]]s and [[Font]]s) into memory, creating specialized objects (such as [[ParticleSystem]]s or [[Canvas]]es) and managing screen geometry.
pt_br: Suas responsabilidades secundárias incluem carregar arquivos externos (incluindo [[Image (Português)|Imagens]] e [[Font (Português)|Fontes]]) na memória, criar objetos especializados (como [[ParticleSystem (Português)|SistemasDePartículas]] ou [[Canvas (Português)|Pinturas]]) e administrar a geometria da tela.

source: angle2
pt_br: angulo2

source: The height of the Quad. (Must be greater than 0.)
pt_br: A altura do Quad. (Tem que ser maior que 0.)

source: radius
pt_br: raio

source: Adds the quit event to the queue.
pt_br: Adiciona o evento quit à fila.

source: Creates a new PixelEffect object for hardware-accelerated pixel level effects.
pt_br: Cria um novo objeto EfeitoDePixel para efeitos com aceleração de hardware a nível de pixel.

source: * [[Tutorial:Audio]]
pt_br: * [[Tutorial:Audio (Português)|Tutorial:Audio]]

source: The new Quad.
pt_br: O novo Quad.

source: The max supported width or height of Images and Canvases.
pt_br: A largura ou altura máxima suportada de Imagens e Pinturas.

source: source = love.audio.newSource( data )
pt_br: fonte = love.audio.newSource( dado )

source: Gets the current line stipple.
pt_br: Obtém o pontilhado de linha atual.

source: Normally all 4 components are active unless [[love.graphics.setColorMask]] has been used.
pt_br: Normalmente todos os 4 componentes estão ativos, a não ser que [[love.graphics.setColorMask (Português)|love.graphics.setColorMask]] tenha sido usada.

source: sx (1)
pt_br: ex (1)

source: The rasterizer.
pt_br: O rasterizador.

source: The new point size.
pt_br: O novo tamanho de ponto.
